experiment/results/compare_high_RPS/no_istio_20251231_173158/wrk_logs/wrk_400rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 137.028ms, rate sampling interval: 779ms
  Thread calibration: mean lat.: 163.325ms, rate sampling interval: 903ms
  Thread calibration: mean lat.: 135.088ms, rate sampling interval: 735ms
  Thread calibration: mean lat.: 124.134ms, rate sampling interval: 713ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   218.18ms  296.06ms   1.40s    87.58%
    Req/Sec    98.99     14.06   136.00     73.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  122.82ms
 75.000%  329.73ms
 90.000%  570.37ms
 99.000%    1.40s 
 99.900%    2.17s 
 99.990%    2.77s 
 99.999%    3.08s 
100.000%    3.08s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.747     0.000000            1         1.00
       2.059     0.100000         3194         1.11
       4.263     0.200000         6366         1.25
       8.519     0.300000         9554         1.43
      19.119     0.400000        12733         1.67
     122.815     0.500000        15915         2.00
     164.735     0.550000        17510         2.22
     199.679     0.600000        19100         2.50
     237.311     0.650000        20694         2.86
     278.527     0.700000        22287         3.33
     329.727     0.750000        23880         4.00
     357.631     0.775000        24672         4.44
     389.375     0.800000        25465         5.00
     424.447     0.825000        26262         5.71
     464.639     0.850000        27056         6.67
     513.279     0.875000        27852         8.00
     539.135     0.887500        28251         8.89
     570.367     0.900000        28650        10.00
     607.743     0.912500        29045        11.43
     653.311     0.925000        29442        13.33
     707.583     0.937500        29844        16.00
     738.815     0.943750        30039        17.78
     778.239     0.950000        30239        20.00
     817.151     0.956250        30440        22.86
     868.351     0.962500        30637        26.67
     925.183     0.968750        30838        32.00
     961.535     0.971875        30934        35.56
    1007.615     0.975000        31034        40.00
    1068.031     0.978125        31133        45.71
    1139.711     0.981250        31236        53.33
    1204.223     0.984375        31332        64.00
    1244.159     0.985938        31382        71.11
    1292.287     0.987500        31432        80.00
    1347.583     0.989062        31482        91.43
    1425.407     0.990625        31532       106.67
    1486.847     0.992188        31581       128.00
    1518.591     0.992969        31606       142.22
    1557.503     0.993750        31631       160.00
    1598.463     0.994531        31655       182.86
    1672.191     0.995313        31680       213.33
    1732.607     0.996094        31705       256.00
    1765.375     0.996484        31718       284.44
    1797.119     0.996875        31730       320.00
    1823.743     0.997266        31742       365.71
    1879.039     0.997656        31755       426.67
    1971.199     0.998047        31767       512.00
    2011.135     0.998242        31774       568.89
    2053.119     0.998437        31781       640.00
    2088.959     0.998633        31786       731.43
    2129.919     0.998828        31792       853.33
    2179.071     0.999023        31798      1024.00
    2248.703     0.999121        31802      1137.78
    2318.335     0.999219        31805      1280.00
    2340.863     0.999316        31808      1462.86
    2377.727     0.999414        31811      1706.67
    2406.399     0.999512        31814      2048.00
    2430.975     0.999561        31817      2275.56
    2430.975     0.999609        31817      2560.00
    2488.319     0.999658        31819      2925.71
    2490.367     0.999707        31820      3413.33
    2603.007     0.999756        31822      4096.00
    2609.151     0.999780        31823      4551.11
    2609.151     0.999805        31823      5120.00
    2617.343     0.999829        31824      5851.43
    2742.271     0.999854        31825      6826.67
    2772.991     0.999878        31826      8192.00
    2772.991     0.999890        31826      9102.22
    2772.991     0.999902        31826     10240.00
    2826.239     0.999915        31827     11702.86
    2826.239     0.999927        31827     13653.33
    2889.727     0.999939        31828     16384.00
    2889.727     0.999945        31828     18204.44
    2889.727     0.999951        31828     20480.00
    2889.727     0.999957        31828     23405.71
    2889.727     0.999963        31828     27306.67
    3082.239     0.999969        31829     32768.00
    3082.239     1.000000        31829          inf
#[Mean    =      218.183, StdDeviation   =      296.061]
#[Max     =     3080.192, Total count    =        31829]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  35761 requests in 1.50m, 27.96MB read
Requests/sec:    397.35  
Transfer/sec:    318.15KB