experiment/results/compare_high_RPS/no_istio_20251231_173158/wrk_logs/wrk_600rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 1013.560ms, rate sampling interval: 4534ms
  Thread calibration: mean lat.: 976.866ms, rate sampling interval: 4894ms
  Thread calibration: mean lat.: 989.894ms, rate sampling interval: 4554ms
  Thread calibration: mean lat.: 1120.159ms, rate sampling interval: 5296ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.98s     5.39s   21.97s    66.00%
    Req/Sec   123.11      7.96   136.00     75.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.11s 
 75.000%   11.42s 
 90.000%   15.86s 
 99.000%   21.97s 
 99.900%   27.05s 
 99.990%   28.84s 
 99.999%   29.21s 
100.000%   29.21s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.772     0.000000            1         1.00
    1587.199     0.100000         3954         1.11
    3022.847     0.200000         7907         1.25
    4321.279     0.300000        11864         1.43
    5672.959     0.400000        15814         1.67
    7114.751     0.500000        19778         2.00
    7827.455     0.550000        21744         2.22
    8577.023     0.600000        23733         2.50
    9388.031     0.650000        25703         2.86
   10272.767     0.700000        27676         3.33
   11419.647     0.750000        29651         4.00
   12042.239     0.775000        30642         4.44
   12648.447     0.800000        31631         5.00
   13328.383     0.825000        32626         5.71
   14041.087     0.850000        33615         6.67
   14934.015     0.875000        34600         8.00
   15368.191     0.887500        35093         8.89
   15859.711     0.900000        35582        10.00
   16375.807     0.912500        36075        11.43
   16990.207     0.925000        36573        13.33
   17645.567     0.937500        37070        16.00
   17956.863     0.943750        37311        17.78
   18333.695     0.950000        37573        20.00
   18759.679     0.956250        37812        22.86
   19169.279     0.962500        38052        26.67
   19611.647     0.968750        38312        32.00
   19841.023     0.971875        38423        35.56
   20103.167     0.975000        38548        40.00
   20398.079     0.978125        38678        45.71
   20676.607     0.981250        38796        53.33
   21037.055     0.984375        38917        64.00
   21250.047     0.985938        38982        71.11
   21512.191     0.987500        39040        80.00
   21823.487     0.989062        39108        91.43
   22069.247     0.990625        39166       106.67
   22347.775     0.992188        39227       128.00
   22527.999     0.992969        39258       142.22
   22773.759     0.993750        39287       160.00
   23068.671     0.994531        39322       182.86
   23330.815     0.995313        39350       213.33
   23527.423     0.996094        39381       256.00
   23724.031     0.996484        39396       284.44
   23904.255     0.996875        39411       320.00
   24444.927     0.997266        39426       365.71
   24805.375     0.997656        39442       426.67
   25182.207     0.998047        39457       512.00
   25657.343     0.998242        39465       568.89
   25935.871     0.998437        39473       640.00
   26148.863     0.998633        39480       731.43
   26656.767     0.998828        39488       853.33
   27082.751     0.999023        39496      1024.00
   27213.823     0.999121        39500      1137.78
   27443.199     0.999219        39504      1280.00
   27492.351     0.999316        39508      1462.86
   27525.119     0.999414        39512      1706.67
   27557.887     0.999512        39515      2048.00
   27639.807     0.999561        39517      2275.56
   27688.959     0.999609        39519      2560.00
   27803.647     0.999658        39523      2925.71
   27803.647     0.999707        39523      3413.33
   27951.103     0.999756        39525      4096.00
   28540.927     0.999780        39526      4551.11
   28753.919     0.999805        39527      5120.00
   28770.303     0.999829        39529      5851.43
   28770.303     0.999854        39529      6826.67
   28835.839     0.999878        39530      8192.00
   28835.839     0.999890        39530      9102.22
   28901.375     0.999902        39531     10240.00
   28901.375     0.999915        39531     11702.86
   28983.295     0.999927        39532     13653.33
   28983.295     0.999939        39532     16384.00
   28983.295     0.999945        39532     18204.44
   29065.215     0.999951        39533     20480.00
   29065.215     0.999957        39533     23405.71
   29065.215     0.999963        39533     27306.67
   29065.215     0.999969        39533     32768.00
   29065.215     0.999973        39533     36408.89
   29212.671     0.999976        39534     40960.00
   29212.671     1.000000        39534          inf
#[Mean    =     7977.760, StdDeviation   =     5394.436]
#[Max     =    29196.288, Total count    =        39534]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  44527 requests in 1.50m, 25.54MB read
Requests/sec:    494.58  
Transfer/sec:    290.44KB